# WinderMinWidthTooLargeFailure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..WinderMinWidthTooLargeFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
The value for Minimum Width on Inside Boundary is too large.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WinderMinWidthTooLargeFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WinderMinWidthTooLargeFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WinderMinWidthTooLargeFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace